docs/_static/data-model/overall-rel.dot
digraph "moduleName" {
node ["shape"="box","fontname"="Arial"]
edge ["color"="darkslategray4","fontname"="Arial"]
"o-ran-smo-teiv-cloudCloudifiedNF" ["label"="CloudifiedNF","style"="filled","fillcolor"="#89240A41"]
"o-ran-smo-teiv-cloudNFDeployment" ["label"="NFDeployment","style"="filled","fillcolor"="#89240A41"]
"o-ran-smo-teiv-cloudNodeCluster" ["label"="NodeCluster","style"="filled","fillcolor"="#89240A41"]
"o-ran-smo-teiv-cloudOCloudNamespace" ["label"="OCloudNamespace","style"="filled","fillcolor"="#89240A41"]
"o-ran-smo-teiv-cloudOCloudSite" ["style"="filled","fillcolor"="#89240A41","label"="OCloudSite"]
"o-ran-smo-teiv-equipmentAntennaModule" ["label"="AntennaModule","style"="filled","fillcolor"="#9A38E341"]
"o-ran-smo-teiv-equipmentSite" ["style"="filled","fillcolor"="#9A38E341","label"="Site"]
"o-ran-smo-teiv-oamManagedElement" ["label"="ManagedElement","style"="filled","fillcolor"="#3663F041"]
"o-ran-smo-teiv-physicalPhysicalAppliance" ["label"="PhysicalAppliance","style"="filled","fillcolor"="#074EE241"]
"o-ran-smo-teiv-physicalSite" ["style"="filled","fillcolor"="#074EE241","label"="Site"]
"o-ran-smo-teiv-ranAntennaCapability" ["style"="filled","fillcolor"="#366F3441","label"="AntennaCapability"]
"o-ran-smo-teiv-ranNRCellCU" ["style"="filled","fillcolor"="#366F3441","label"="NRCellCU"]
"o-ran-smo-teiv-ranNRCellDU" ["label"="NRCellDU","style"="filled","fillcolor"="#366F3441"]
"o-ran-smo-teiv-ranNRSectorCarrier" ["label"="NRSectorCarrier","style"="filled","fillcolor"="#366F3441"]
"o-ran-smo-teiv-ranNearRTRICFunction" ["label"="NearRTRICFunction","style"="filled","fillcolor"="#366F3441"]
"o-ran-smo-teiv-ranOCUCPFunction" ["label"="OCUCPFunction","style"="filled","fillcolor"="#366F3441"]
"o-ran-smo-teiv-ranOCUUPFunction" ["label"="OCUUPFunction","style"="filled","fillcolor"="#366F3441"]
"o-ran-smo-teiv-ranODUFunction" ["label"="ODUFunction","style"="filled","fillcolor"="#366F3441"]
"o-ran-smo-teiv-ranORUFunction" ["label"="ORUFunction","style"="filled","fillcolor"="#366F3441"]
"o-ran-smo-teiv-ranSMO" ["style"="filled","fillcolor"="#366F3441","label"="SMO"]
"o-ran-smo-teiv-ranSector" ["label"="Sector","style"="filled","fillcolor"="#366F3441"]
"o-ran-smo-teiv-cloudCloudifiedNF" -> "o-ran-smo-teiv-cloudNFDeployment" ["label"="COMPRISES","headlabel"="1..1","taillabel"="1..*","arrowhead"="vee"]
"o-ran-smo-teiv-cloudNFDeployment" -> "o-ran-smo-teiv-ranODUFunction" ["label"="SERVES","headlabel"="0..*","taillabel"="0..*","arrowhead"="vee"]
"o-ran-smo-teiv-cloudNFDeployment" -> "o-ran-smo-teiv-ranOCUUPFunction" ["label"="SERVES","headlabel"="0..*","taillabel"="0..*","arrowhead"="vee"]
"o-ran-smo-teiv-cloudNFDeployment" -> "o-ran-smo-teiv-ranOCUCPFunction" ["label"="SERVES","headlabel"="0..*","taillabel"="0..*","arrowhead"="vee"]
"o-ran-smo-teiv-cloudNFDeployment" -> "o-ran-smo-teiv-ranNearRTRICFunction" ["label"="SERVES","headlabel"="0..*","taillabel"="0..*","arrowhead"="vee"]
"o-ran-smo-teiv-cloudNFDeployment" -> "o-ran-smo-teiv-oamManagedElement" ["label"="SERVES","headlabel"="1..*","taillabel"="1..1","arrowhead"="vee"]
"o-ran-smo-teiv-cloudNFDeployment" -> "o-ran-smo-teiv-cloudOCloudNamespace" ["label"="DEPLOYED","headlabel"="1..*","taillabel"="1..*","arrowhead"="vee"]
"o-ran-smo-teiv-cloudNodeCluster" -> "o-ran-smo-teiv-cloudOCloudSite" ["label"="LOCATED","headlabel"="1..*","taillabel"="1..*","arrowhead"="vee"]
"o-ran-smo-teiv-cloudOCloudNamespace" -> "o-ran-smo-teiv-cloudNodeCluster" ["label"="DEPLOYED","headlabel"="1..*","taillabel"="1..1","arrowhead"="vee"]
"o-ran-smo-teiv-equipmentAntennaModule" -> "o-ran-smo-teiv-ranNRCellDU" ["label"="SERVES","headlabel"="1..*","taillabel"="0..*","arrowhead"="vee"]
"o-ran-smo-teiv-equipmentAntennaModule" -> "o-ran-smo-teiv-ranAntennaCapability" ["label"="SERVES","headlabel"="0..*","taillabel"="0..*","arrowhead"="vee"]
"o-ran-smo-teiv-equipmentAntennaModule" -> "o-ran-smo-teiv-equipmentSite" ["label"="INSTALLED","headlabel"="0..*","taillabel"="0..1","arrowhead"="vee"]
"o-ran-smo-teiv-oamManagedElement" -> "o-ran-smo-teiv-ranORUFunction" ["label"="MANAGES","headlabel"="1..1","taillabel"="0..*","arrowhead"="vee"]
"o-ran-smo-teiv-oamManagedElement" -> "o-ran-smo-teiv-ranODUFunction" ["label"="MANAGES","headlabel"="1..1","taillabel"="0..*","arrowhead"="vee"]
"o-ran-smo-teiv-oamManagedElement" -> "o-ran-smo-teiv-ranOCUUPFunction" ["label"="MANAGES","headlabel"="1..1","taillabel"="0..*","arrowhead"="vee"]
"o-ran-smo-teiv-oamManagedElement" -> "o-ran-smo-teiv-ranOCUCPFunction" ["label"="MANAGES","headlabel"="1..1","taillabel"="0..*","arrowhead"="vee"]
"o-ran-smo-teiv-oamManagedElement" -> "o-ran-smo-teiv-ranNearRTRICFunction" ["label"="MANAGES","headlabel"="1..1","taillabel"="0..*","arrowhead"="vee"]
"o-ran-smo-teiv-oamManagedElement" -> "o-ran-smo-teiv-cloudCloudifiedNF" ["label"="DEPLOYED","headlabel"="1..1","taillabel"="0..1","arrowhead"="vee"]
"o-ran-smo-teiv-physicalPhysicalAppliance" -> "o-ran-smo-teiv-ranODUFunction" ["label"="SERVES","headlabel"="0..*","taillabel"="0..*","arrowhead"="vee"]
"o-ran-smo-teiv-physicalPhysicalAppliance" -> "o-ran-smo-teiv-ranOCUUPFunction" ["label"="SERVES","headlabel"="0..*","taillabel"="0..*","arrowhead"="vee"]
"o-ran-smo-teiv-physicalPhysicalAppliance" -> "o-ran-smo-teiv-ranOCUCPFunction" ["label"="SERVES","headlabel"="0..*","taillabel"="0..*","arrowhead"="vee"]
"o-ran-smo-teiv-physicalPhysicalAppliance" -> "o-ran-smo-teiv-ranNearRTRICFunction" ["label"="SERVES","headlabel"="0..*","taillabel"="0..*","arrowhead"="vee"]
"o-ran-smo-teiv-physicalPhysicalAppliance" -> "o-ran-smo-teiv-physicalSite" ["label"="INSTALLEDAT","headlabel"="0..*","taillabel"="0..*","arrowhead"="vee"]
"o-ran-smo-teiv-ranNRCellDU" -> "o-ran-smo-teiv-ranNRSectorCarrier" ["label"="USES","headlabel"="0..1","taillabel"="0..*","arrowhead"="vee"]
"o-ran-smo-teiv-ranNRSectorCarrier" -> "o-ran-smo-teiv-ranAntennaCapability" ["label"="USES","headlabel"="0..*","taillabel"="0..1","arrowhead"="vee"]
"o-ran-smo-teiv-ranNearRTRICFunction" -> "o-ran-smo-teiv-ranSMO" ["label"="O1LINK","headlabel"="0..*","taillabel"="0..1","arrowhead"="vee"]
"o-ran-smo-teiv-ranOCUCPFunction" -> "o-ran-smo-teiv-ranNRCellCU" ["label"="PROVIDES","headlabel"="1..1","taillabel"="0..*","arrowhead"="vee"]
"o-ran-smo-teiv-ranOCUCPFunction" -> "o-ran-smo-teiv-ranSMO" ["label"="O1LINK","headlabel"="0..*","taillabel"="0..1","arrowhead"="vee"]
"o-ran-smo-teiv-ranOCUCPFunction" -> "o-ran-smo-teiv-ranNearRTRICFunction" ["label"="E2LINK","headlabel"="0..*","taillabel"="0..1","arrowhead"="vee"]
"o-ran-smo-teiv-ranOCUCPFunction" -> "o-ran-smo-teiv-ranOCUUPFunction" ["label"="E1LINK","headlabel"="0..*","taillabel"="0..1","arrowhead"="vee"]
"o-ran-smo-teiv-ranOCUUPFunction" -> "o-ran-smo-teiv-ranNearRTRICFunction" ["label"="E2LINK","headlabel"="0..*","taillabel"="0..1","arrowhead"="vee"]
"o-ran-smo-teiv-ranODUFunction" -> "o-ran-smo-teiv-ranNRSectorCarrier" ["label"="PROVIDES","headlabel"="1..1","taillabel"="0..*","arrowhead"="vee"]
"o-ran-smo-teiv-ranODUFunction" -> "o-ran-smo-teiv-ranNRCellDU" ["label"="PROVIDES","headlabel"="1..1","taillabel"="0..*","arrowhead"="vee"]
"o-ran-smo-teiv-ranODUFunction" -> "o-ran-smo-teiv-ranSMO" ["label"="O1LINK","headlabel"="0..*","taillabel"="0..1","arrowhead"="vee"]
"o-ran-smo-teiv-ranODUFunction" -> "o-ran-smo-teiv-ranOCUUPFunction" ["label"="F1ULINK","headlabel"="0..*","taillabel"="0..1","arrowhead"="vee"]
"o-ran-smo-teiv-ranODUFunction" -> "o-ran-smo-teiv-ranOCUCPFunction" ["label"="F1CLINK","headlabel"="0..1","taillabel"="0..1","arrowhead"="vee"]
"o-ran-smo-teiv-ranODUFunction" -> "o-ran-smo-teiv-ranNearRTRICFunction" ["label"="E2LINK","headlabel"="0..*","taillabel"="0..1","arrowhead"="vee"]
"o-ran-smo-teiv-ranORUFunction" -> "o-ran-smo-teiv-ranODUFunction" ["label"="OFHULINK","headlabel"="0..*","taillabel"="0..1","arrowhead"="vee"]
"o-ran-smo-teiv-ranORUFunction" -> "o-ran-smo-teiv-ranODUFunction" ["label"="OFHSLINK","headlabel"="0..*","taillabel"="0..1","arrowhead"="vee"]
"o-ran-smo-teiv-ranORUFunction" -> "o-ran-smo-teiv-ranSMO" ["label"="OFHMLINK","headlabel"="0..*","taillabel"="0..1","arrowhead"="vee"]
"o-ran-smo-teiv-ranORUFunction" -> "o-ran-smo-teiv-ranODUFunction" ["label"="OFHMLINK","headlabel"="0..*","taillabel"="0..1","arrowhead"="vee"]
"o-ran-smo-teiv-ranORUFunction" -> "o-ran-smo-teiv-ranODUFunction" ["label"="OFHCLINK","headlabel"="0..*","taillabel"="0..1","arrowhead"="vee"]
"o-ran-smo-teiv-ranORUFunction" -> "o-ran-smo-teiv-ranSMO" ["label"="O1LINK","headlabel"="0..*","taillabel"="0..1","arrowhead"="vee"]
"o-ran-smo-teiv-ranSector" -> "o-ran-smo-teiv-ranNRCellDU" ["label"="GROUPS","headlabel"="0..1","taillabel"="0..*","arrowhead"="vee"]
"o-ran-smo-teiv-ranSector" -> "o-ran-smo-teiv-equipmentAntennaModule" ["label"="GROUPS","headlabel"="0..1","taillabel"="0..*","arrowhead"="vee"]
}
